#+Title: Profunctor optics: a categorical update
#+Date: September 5, 2019
#+beamer_header: \institute{\small\textsc{SYCO 5, University of Birmingham}}
#+beamer_header: \author{\textit{Mario Román}, Bryce Clarke, Fosco Loregian, Emily Pillmore,\\ Derek Elkins, Bartosz Milewski and Jeremy Gibbons}

# Look for TODOs

* Code                                                                                    :noexport:

#+BEGIN_SRC emacs-lisp
  (setq org-emphasis-alist 
    '(("*" (:weight ultra-bold :foreground "#4f97d7")) 
      ("/" (:slant italic :foreground "#4f97d7")) 
      ("_" underline) 
      ("~" (:weight ultra-bold :foreground "#4f97d7"))
      ("=" org-verbatim verbatim) 
      ("+" (:strike-through t))))
#+END_SRC

#+RESULTS:
| * | (:weight ultra-bold :foreground #4f97d7) |          |
| _ | underline                                |          |
| ~ | (:weight ultra-bold :foreground #4f97d7) |          |
| = | org-verbatim                             | verbatim |
| + | (:strike-through t)                      |          |




          ~ncafe>~ let address = "45 Banbury Rd, OX1 3QD, Oxford"
          
          ~ncafe>~ address^.postal
            /Street:   45 Banbury Rd/ 
            /Code:     OX2 6LH/ 
            /City:     Oxford/ 
          
          ~ncafe>~ address^.postal.street
          /"45 Banbury Rd"/
          
          ~ncafe>~ address^.postal.street %~ "7 Banbury Rd"
          /"7 Banbury Rd, OX1 3QD, Oxford"/ 
          
          ~ncafe>~ address^.postal.city <>~ " (UK)"
          /"47 Banbury Rd, OX1 3QD, Oxford (UK)"/ 
          
          ~ncafe>~ 





          *act>* someMailingList
          /|                 Name |                          Email |  Frequency |/
          /----------------------------------------------------------------------/ 
          /|         Turing, Alan |               turing@man.ac.uk |      Daily |/ 
          /|       Noether, Emily |             emmynoether@fau.eu |    Monthly |/ 
          /|       Gauss, Carl F. |            gauss@goettingen.de |     Weekly |/ 

          *act>* someMailingList^..mails
          /["turing@man.ac.uk","emmynoether@fau.eu","gauss@goettingen.de"]/ 
          
          *act>* someMailingList^..mails.email.domain
          /["man.ac.uk","fau.eu","goettingen.de"]/ 

          *act>* someMailingList^..mails.email.domain <~~~ uppercase
          /|                 Name |                          Email |  Frequency |/ 
          /----------------------------------------------------------------------/ 
          /|         Turing, Alan |               turing@MAN.AC.UK |      Daily |/ 
          /|       Noether, Emily |             emmynoether@FAU.EU |    Monthly |/ 
          /|       Gauss, Carl F. |            gauss@GOETTINGEN.DE |     Weekly |/

          *act>* 
          
